---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedpathMergedPointNum
source: html/f9bfac85-7e49-2041-9f4f-b1264c710629.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedpathMergedPointNum Property

"Total Number of Nodes"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedpathMergedPointNum { get; }
```